app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at
---
  	def index
    	@posts = Post.order('created_at')