app/controllers/posts_controller.rb

  	def index
    	@posts = Post.order('created_at')
---
SELECT "posts".* FROM "posts"  ORDER BY created_at

	def create
		@post = Post.new(post_params)
		@post.likes = 0
		@post.user = current_user
		if @post.save
---
INSERT INTO "posts" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "caption", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)